In [1]:
import numpy as np
import pandas as pd

In [2]:
dta=pd.DataFrame()
print(dta)

Empty DataFrame
Columns: []
Index: []

In [3]:
dta1=pd.DataFrame([[1,2,3,4],[2,3,4,5],[3,4,4,5],[4,6,7,8],[4,9,8,7]])
dta1

   0  1  2  3
0  1  2  3  4
1  2  3  4  5
2  3  4  4  5
3  4  6  7  8
4  4  9  8  7

In [4]:
dta1.head(2)

   0  1  2  3
0  1  2  3  4
1  2  3  4  5

In [5]:
dta1.tail(3)

   0  1  2  3
2  3  4  4  5
3  4  6  7  8
4  4  9  8  7

In [6]:
dta1.shape

(5, 4)

In [7]:
dta1.iloc[0,2]

3

In [8]:
dta1

   0  1  2  3
0  1  2  3  4
1  2  3  4  5
2  3  4  4  5
3  4  6  7  8
4  4  9  8  7

In [9]:
dta1.iloc[1:4,1:]

   1  2  3
1  3  4  5
2  4  4  5
3  6  7  8

In [10]:
dta1.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
dta1.columns

RangeIndex(start=0, stop=4, step=1)

In [12]:
dta1.T

   0  1  2  3  4
0  1  2  3  4  4
1  2  3  4  6  9
2  3  4  4  7  8
3  4  5  5  8  7

# Reading csv file

In [13]:
df=pd.read_csv('lendingdata.csv')

In [14]:
df

,Unnamed: 0,activity,borrower_genders,country,country_code,currency_policy,distribution_model,lender_count,loan_amount,original_language,repayment_interval,sector,status,term_in_months,rMPI
0,0,Home Appliances,group,Cambodia,KH,shared,field_partner,5.0,125.0,English,monthly,Personal Use,funded,8,0.097
1,1,Cereals,female,Philippines,PH,shared,field_partner,5.0,125.0,English,irregular,Food,funded,14,0.055
2,2,Clothing Sales,female,Peru,PE,shared,field_partner,10.0,375.0,Spanish,monthly,Clothing,funded,8,0.000
3,3,Clothing Sales,female,Tajikistan,TJ,not shared,field_partner,27.0,850.0,English,monthly,Clothing,funded,14,0.021
4,4,Fish Selling,female,Uganda,UG,not shared,field_partner,17.0,550.0,English,irregular,Food,funded,9,0.417
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27531,27531,Services,female,Zambia,ZM,shared,field_partner,85.0,2300.0,English,bullet,Services,funded,9,0.158
27532,27532,Pigs,female,Philippines,PH,not shared,field_partner,17.0,475.0,English,irregular,Agriculture,funded,8,0.422
27533,27533,General Store,female,Philippines,PH,shared,field_partner,38.0,1075.0,English,irregular,Retail,funded,11,0.055
27534,27534,Food Market,female,Ghana,GH,shared,field_partner,35.0,1075.0,English,irregular,Food,funded,6,0.122
27535,27535,Farming,male,Tajikistan,TJ,not shared,field_partner,55.0,2000.0,English,monthly,Agriculture,funded,14,0.033

In [15]:
df['country'].astype('category')

0           Cambodia
1        Philippines
2               Peru
3         Tajikistan
4             Uganda
            ...
27531         Zambia
27532    Philippines
27533    Philippines
27534          Ghana
27535     Tajikistan
Name: country, Length: 27536, dtype: category
Categories (61, object): [Afghanistan, Belize, Benin, Bolivia, ..., Vietnam, Yemen, Zambia, Zimbabwe]

df['country'].dtype

In [16]:
print(df['country_code'])

0        KH
1        PH
2        PE
3        TJ
4        UG
         ..
27531    ZM
27532    PH
27533    PH
27534    GH
27535    TJ
Name: country_code, Length: 27536, dtype: object

# Writing Csv File

In [17]:
dta1=pd.DataFrame([[1,3,4,5],[12,3,4,5],[1,3,3,4]],columns=['a','b','c','d'])
dta1

    a  b  c  d
0   1  3  4  5
1  12  3  4  5
2   1  3  3  4

In [18]:
dta1.to_csv('export.csv')

In [19]:
dta1.to_csv('export.csv',index=False)